Revit 2027 API
FailureMessageAccessor.GetCurrentResolutionType Method
 Retrieves the type of resolution to be used to resolve the failure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FailureResolutionType GetCurrentResolutionType()
Public Function GetCurrentResolutionType As FailureResolutionType
public:
FailureResolutionType GetCurrentResolutionType()
member GetCurrentResolutionType : unit -> FailureResolutionType
Return Value
FailureResolutionType
 The type of failure resolution to be used to resolve the failure.
Exceptions
Exception | Condition
InvalidOperationException |  This FailureMessageAccessor has not been properly initialized. -or- This FailureMessageAccessor does not have any resolutions.
Remarks
 If the current resolution type was never set for the failure, FailureResolutionType::Default is returned.
See Also
Reference
FailureMessageAccessor Class
Autodesk.Revit.DB Namespace